{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "facenet_simple",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              160,
              160,
              3
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "filters": 32,
            "kernel_size": [
              7,
              7
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same",
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d_1",
            "pool_size": [
              3,
              3
            ],
            "strides": [
              2,
              2
            ],
            "padding": "same"
          }
        },
        {
          "class_name": "GlobalAveragePooling2D",
          "config": {
            "name": "global_average_pooling2d_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "units": 128,
            "activation": "linear"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [
            7,
            7,
            3,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            1568,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}